backend/performance_test/load-test-regiondev.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Sustained load"
scenarios:
  - flow:
      # Step 1: Log in automatically
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@taxtrail.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"

      # Step 2: Run the actual test using the captured token
      - get:
          url: "/api/v1/regional-development/inequality-index"
          headers:
            Authorization: "Bearer {{ authToken }}"